html/kotlin/collections/transform.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>集合转换</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./operation.html"> UP </a>
 |
 <a accesskey="H" href="./collections.html"> HOME </a>
</div><div id="content">
<h1 class="title">集合转换</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf531a78">映射</a></li>
<li><a href="#org32ecd5a">双路合并</a></li>
<li><a href="#orgbde6b3f">关联</a></li>
<li><a href="#orgb9b3e9f">打平</a></li>
<li><a href="#org3b79dad">字符串表示</a></li>
</ul>
</div>
</div>
<p>
Kotlin 标准库为集合 <span class="underline">转换</span> 提供了一组扩展函数。 这些函数根据提供的转换规则从现有集合中构建新集合
</p>
<div id="outline-container-orgf531a78" class="outline-2">
<h2 id="orgf531a78">映射</h2>
<div class="outline-text-2" id="text-orgf531a78">
<p>
<b>映射</b> 转换从另一个集合的元素上的函数结果创建一个集合。 基本的映射函数是 <span class="underline">map()</span> ：
</p>
<ul class="org-ul">
<li>它将给定的 lambda 函数应用于每个后续元素，并返回 lambda 结果列表</li>
<li>结果的顺序与元素的原始顺序相同</li>
<li>如需应用还要用到元素索引作为参数的转换，请使用 <span class="underline">mapIndexed()</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = setOf(1, 2, 3)
    println(numbers.map { <span style="color: #00bfff; font-weight: bold;">it</span> * 3 })
    println(numbers.mapIndexed { idx, value -&gt; value * idx })
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
如果转换在某些元素上产生 null 值，则可以通过调用 <span class="underline">mapNotNull()</span> 函数取代 map() 或 <span class="underline">mapIndexedNotNull()</span> 取代 mapIndexed() 来从结果集中过滤掉 null 值：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = setOf(1, 2, 3)
    println(numbers.mapNotNull { <span style="color: #00bfff; font-weight: bold;">if</span> ( <span style="color: #00bfff; font-weight: bold;">it</span> == 2) <span style="color: #ffd700;">null</span> <span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #00bfff; font-weight: bold;">it</span> * 3 })
    println(numbers.mapIndexedNotNull { idx, value -&gt; <span style="color: #00bfff; font-weight: bold;">if</span> (idx == 0) <span style="color: #ffd700;">null</span> <span style="color: #00bfff; font-weight: bold;">else</span> value * idx })
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
映射转换时，有两个选择：转换键，使值保持不变，反之亦然：
</p>
<ul class="org-ul">
<li>要将指定转换应用于键，请使用 <span class="underline">mapKeys()</span></li>
<li>反过来 <span class="underline">mapValues()</span> 转换值</li>
</ul>

<p>
这两个函数都使用将映射条目作为参数的转换，因此可以操作其键与值：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mapOf(<span style="color: #deb887;">"key1"</span> to 1, <span style="color: #deb887;">"key2"</span> to 2, <span style="color: #deb887;">"key3"</span> to 3, <span style="color: #deb887;">"key11"</span> to 11)
    println(numbersMap.mapKeys { <span style="color: #00bfff; font-weight: bold;">it</span>.key.toUpperCase() })
    println(numbersMap.mapValues { <span style="color: #00bfff; font-weight: bold;">it</span>.value + <span style="color: #00bfff; font-weight: bold;">it</span>.key.length })
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org32ecd5a" class="outline-2">
<h2 id="org32ecd5a">双路合并</h2>
<div class="outline-text-2" id="text-org32ecd5a">
<p>
<b>双路合并</b> 转换是根据两个集合中具有 <span class="underline">相同位置</span> 的 <span class="underline">元素</span> 构建 <span class="underline">配对</span> 。 在 Kotlin 标准库中，这是通过 <span class="underline">zip()</span> 扩展函数完成的：
</p>
<ul class="org-ul">
<li>在一个集合（或数组）上以另一个集合（或数组）作为参数调用时，zip() 返回 Pair 对象的列表（List）</li>
<li>接收者集合的元素是这些配对中的第一个元素</li>
<li>如果集合的大小不同，则 zip() 的结果为较小集合的大小，结果中不包含较大集合的后续元素</li>
<li>zip() 也可以中缀形式调用 <span class="underline">a zip b</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">colors</span> = listOf(<span style="color: #deb887;">"red"</span>, <span style="color: #deb887;">"brown"</span>, <span style="color: #deb887;">"grey"</span>)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">animals</span> = listOf(<span style="color: #deb887;">"fox"</span>, <span style="color: #deb887;">"bear"</span>, <span style="color: #deb887;">"wolf"</span>)
    println(colors zip animals)

    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">twoAnimals</span> = listOf(<span style="color: #deb887;">"fox"</span>, <span style="color: #deb887;">"bear"</span>)
    println(colors.zip(twoAnimals))
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
也可以使用带有两个参数的转换函数来调用 zip()： <span class="underline">接收者元素</span> 和 <span class="underline">参数元素</span> 。 在这种情况下，结果 List 包含在具有相同位置的接收者对和参数元素对上调用的转换函数的返回值：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">colors</span> = listOf(<span style="color: #deb887;">"red"</span>, <span style="color: #deb887;">"brown"</span>, <span style="color: #deb887;">"grey"</span>)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">animals</span> = listOf(<span style="color: #deb887;">"fox"</span>, <span style="color: #deb887;">"bear"</span>, <span style="color: #deb887;">"wolf"</span>)

    println(colors.zip(animals) { color, animal -&gt; <span style="color: #deb887;">"The ${</span>animal.capitalize()<span style="color: #deb887;">} is </span><span style="color: #4eee94;">$color</span><span style="color: #deb887;">"</span>})
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
当拥有 Pair 的 List 时，可以进行反向转换 <span class="underline">unzipping</span> ，从这些键值对中构建两个列表：
</p>
<ul class="org-ul">
<li>第一个列表包含原始列表中每个 Pair 的键</li>
<li>第二个列表包含原始列表中每个 Pair 的值</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numberPairs</span> = listOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3, <span style="color: #deb887;">"four"</span> to 4)
    println(numberPairs.unzip())
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbde6b3f" class="outline-2">
<h2 id="orgbde6b3f">关联</h2>
<div class="outline-text-2" id="text-orgbde6b3f">
<p>
<b>关联</b> 转换允许从集合元素和与其关联的某些值构建 <span class="underline">Map</span> 
</p>

<pre class="example">
    在不同的关联类型中，元素可以是关联 Map 中的键或值
</pre>

<p>
基本的关联函数 <span class="underline">associateWith()</span> 创建一个 Map，其中原始集合的元素是键，并通过给定的转换函数从中产生值。 如果两个元素相等，则仅最后一个保留在 Map 中 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(<span style="color: #deb887;">"one"</span>, <span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"three"</span>, <span style="color: #deb887;">"four"</span>)
    println(numbers.associateWith { <span style="color: #00bfff; font-weight: bold;">it</span>.length })
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
为了使用集合元素作为值来构建 Map，有一个函数 <span class="underline">associateBy()</span> 。 它需要一个函数，该函数根据元素的值返回键。如果两个元素相等，则仅最后一个保留在 Map 中。 还可以使用值转换函数来调用 associateBy() 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(<span style="color: #deb887;">"one"</span>, <span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"three"</span>, <span style="color: #deb887;">"four"</span>)

    println(numbers.associateBy { <span style="color: #00bfff; font-weight: bold;">it</span>.first().toUpperCase() })
    println(numbers.associateBy(keySelector = { <span style="color: #00bfff; font-weight: bold;">it</span>.first().toUpperCase() }, valueTransform = { <span style="color: #00bfff; font-weight: bold;">it</span>.length }))
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
另一种构建 Map 的方法是使用函数 <span class="underline">associate()</span> ，其中 Map 键和值都是通过集合元素生成的。 它需要一个 lambda 函数，该函数返回 Pair：键和相应 Map 条目的值：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #00bfff; font-weight: bold;">data</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">FullName</span> (<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">firstName</span>: <span style="color: #98f5ff;">String</span>, <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">lastName</span>: <span style="color: #98f5ff;">String</span>)

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">parseFullName</span>(fullName: <span style="color: #98f5ff;">String</span>): <span style="color: #98f5ff;">FullName</span> {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">nameParts</span> = fullName.split(<span style="color: #deb887;">" "</span>)
    <span style="color: #00bfff; font-weight: bold;">if</span> (nameParts.size == 2) {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #98f5ff;">FullName</span>(nameParts[0], nameParts[1])
    } <span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #00bfff; font-weight: bold;">throw</span> <span style="color: #98f5ff;">Exception</span>(<span style="color: #deb887;">"Wrong name format"</span>)
}

<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">names</span> = listOf(<span style="color: #deb887;">"Alice Adams"</span>, <span style="color: #deb887;">"Brian Brown"</span>, <span style="color: #deb887;">"Clara Campbell"</span>)
    println(names.associate { name -&gt; parseFullName(name).let { <span style="color: #00bfff; font-weight: bold;">it</span>.lastName to <span style="color: #00bfff; font-weight: bold;">it</span>.firstName } })  
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<pre class="example">
    请注意，associate() 会生成临时的 Pair 对象，这可能会影响性能

    因此，当性能不是很关键或比其他选项更可取时，使用 associate()
</pre>
</div>
</div>
<div id="outline-container-orgb9b3e9f" class="outline-2">
<h2 id="orgb9b3e9f">打平</h2>
<div class="outline-text-2" id="text-orgb9b3e9f">
<pre class="example">
    如需操作嵌套的集合，则可能会发现提供对嵌套集合元素进行打平访问的标准库函数很有用
</pre>


<p>
第一个函数为 <span class="underline">flatten()</span> 。可以在一个集合的集合（例如，一个 Set 组成的 List）上调用它。 该函数返回嵌套集合中的所有元素的一个 List 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numberSets</span> = listOf(setOf(1, 2, 3), setOf(4, 5, 6), setOf(1, 2))
    println(numberSets.flatten())
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
另一个函数 <span class="underline">flatMap()</span> 提供了一种灵活的方式来处理嵌套的集合：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">data</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">StringContainer</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">values</span>: <span style="color: #98f5ff;">List&lt;String&gt;</span>)

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">containers</span> = listOf(
        <span style="color: #98f5ff;">StringContainer</span>(listOf(<span style="color: #deb887;">"one"</span>, <span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"three"</span>)),
        <span style="color: #98f5ff;">StringContainer</span>(listOf(<span style="color: #deb887;">"four"</span>, <span style="color: #deb887;">"five"</span>, <span style="color: #deb887;">"six"</span>)),
        <span style="color: #98f5ff;">StringContainer</span>(listOf(<span style="color: #deb887;">"seven"</span>, <span style="color: #deb887;">"eight"</span>))
    )
    println(containers.flatMap { <span style="color: #00bfff; font-weight: bold;">it</span>.values })
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<pre class="example">
flatMap() 等价于 map()（以集合作为映射结果）与 flatten() 的连续调用
</pre>
</div>
</div>
<div id="outline-container-org3b79dad" class="outline-2">
<h2 id="org3b79dad">字符串表示</h2>
<div class="outline-text-2" id="text-org3b79dad">
<p>
如果需要以可读格式检索集合内容，请使用将集合转换为字符串的函数：joinToString() 与 joinTo()。
</p>
<ul class="org-ul">
<li><span class="underline">joinToString()</span> : 根据提供的参数从集合元素构建单个 String</li>
<li><span class="underline">joinTo()</span> : 执行相同的操作，但将结果附加到给定的 Appendable 对象</li>
</ul>

<pre class="example">
    当使用默认参数调用时，函数返回的结果类似于在集合上调用 toString()：各元素的字符串表示形式以空格分隔而成的 String
</pre>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(<span style="color: #deb887;">"one"</span>, <span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"three"</span>, <span style="color: #deb887;">"four"</span>)

    println(numbers)         
    println(numbers.joinToString())

    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">listString</span> = <span style="color: #98f5ff;">StringBuffer</span>(<span style="color: #deb887;">"The list of numbers: "</span>)
    numbers.joinTo(listString)
    println(listString)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
要构建自定义字符串表示形式，可以在函数参数 <span class="underline">separator</span> 、 <span class="underline">prefix</span> 与 <span class="underline">postfix</span> 中指定其参数。 结果字符串将以 prefix 开头，以 postfix 结尾。除最后一个元素外，separator 将位于每个元素之后 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(<span style="color: #deb887;">"one"</span>, <span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"three"</span>, <span style="color: #deb887;">"four"</span>)    
    println(numbers.joinToString(separator = <span style="color: #deb887;">" | "</span>, prefix = <span style="color: #deb887;">"start: "</span>, postfix = <span style="color: #deb887;">": end"</span>))
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
对于较大的集合，可能需要指定 <span class="underline">limit</span> : 将包含在结果中元素的数量。 如果集合大小超出 limit，所有其他元素将被 <span class="underline">truncated</span> 参数的单个值替换 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = (1..100).toList()
    println(numbers.joinToString(limit = 10, truncated = <span style="color: #deb887;">"&lt;...&gt;"</span>))
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
最后，要自定义元素本身的表示形式，请提供 <span class="underline">transform</span> 函数：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(<span style="color: #deb887;">"one"</span>, <span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"three"</span>, <span style="color: #deb887;">"four"</span>)
    println(numbers.joinToString { <span style="color: #deb887;">"Element: ${</span><span style="color: #00bfff; font-weight: bold;">it</span>.toUpperCase()<span style="color: #deb887;">}"</span>})
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="filter.html">Next：过滤</a></td>
<td class="org-left"><a href="operation.html">Previous：操作</a></td>
<td class="org-left"><a href="collections.html">Home：集合</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
